Revit 2027 API
ExporterIFCUtils.TransformAndScalePoint Method
 Converts a point from global Revit coordinates to current IFC coordinates, including scale.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ TransformAndScalePoint(
	ExporterIFC exporterIFC,
	XYZ origPt
)
Public Shared Function TransformAndScalePoint (
	exporterIFC As ExporterIFC,
	origPt As XYZ
) As XYZ
public:
static XYZ^ TransformAndScalePoint(
	ExporterIFC^ exporterIFC,
	XYZ^ origPt
)
static member TransformAndScalePoint :
        exporterIFC : ExporterIFC *
        origPt : XYZ -> XYZ
Parameters
exporterIFC ExporterIFC
 The exporter.
origPt XYZ
 The original point.
Return Value
XYZ
 The transformed and scaled point.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace